Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.AnalysisMethodEnum Enumeration
 The analysis methods.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AnalysisMethodEnum
Public Enumeration AnalysisMethodEnum
Members
Member name | Value | Description
FIRST_ORDER | 1 |  The first order analysis method.
SECOND_ORDER | 2 |  The second order analysis method.
P_DELTA | 3 |  The P Delta analysis method.
See Also
Reference
Tekla.Structures.Analysis Namespace